# InSessionViewSheetSet Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InSessionViewSheetSet Members
InSessionViewSheetSet Class Methods Properties See Also
---
The InSessionViewSheetSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the InSessionViewSheetSet |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsAutomatic | Automatic order or manual order. |
| OrderedViewList | Ordered views. |
| SheetOrganizationId | ElementId to the BrowserOrganization for sheets. |
| ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views. |
| Views | The views. |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace